app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-18 23:27:49.835290"], ["title", "Brand New Post"], ["updated_at", "2014-11-18 23:27:49.835290"]]

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 10  [["image_content_type", "image/png"], ["image_file_name", "beast.png"], ["image_file_size", 27720], ["image_updated_at", "2014-11-20 03:54:33.721349"], ["updated_at", "2014-11-20 03:54:33.765543"]]